Courses/7140/Lectures/Assertions/assertions-101.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assertions 101</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="On Assertions in Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Assertions 101</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8e98309">1. Abstract</a></li>
<li><a href="#orgd4de046">2. <del>Program</del> Process State</a>
<ul>
<li><a href="#org30c8169">2.1. Process State: Crudely</a></li>
<li><a href="#org1de41f0">2.2. Process State: Refined</a></li>
</ul>
</li>
<li><a href="#orga6e8fab">3. What are Assertions?</a></li>
<li><a href="#org004d051">4. Floyd-Hoare Triplets</a>
<ul>
<li><a href="#orged8c0b3">4.1. Semantics of {P} S {Q}</a></li>
<li><a href="#orgbc5e5be">4.2. Pre-Conditions (aka Entry Assertions)</a></li>
<li><a href="#org620c9b4">4.3. Post-Conditions (aka Exit Assertions)</a></li>
<li><a href="#orge7a9fd2">4.4. Weakest and Strongest</a></li>
<li><a href="#org22dc590">4.5. Design-by-Contract</a></li>
</ul>
</li>
<li><a href="#org7c11a5d">5. Loop Invariant</a></li>
<li><a href="#orgbcf5fdc">6. Class Invariant</a></li>
<li><a href="#orgc3d86ee">7. Assertion Examples</a></li>
<li><a href="#org539cd96">8. The Meaning of Silence</a></li>
<li><a href="#orge0104fe">9. For All &#x2026;</a></li>
<li><a href="#org0e15932">10. "When" and "for how long" must an assertion be true?</a></li>
<li><a href="#orgff833b8">11. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8e98309" class="outline-2">
<h2 id="org8e98309"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
An assertion is an expression on program state that evaluates to true
or false.  Without side effects.  Simple assertions are made up of
Boolean expressions.  Deeper assertions use First or Higher Order
Logics.  These notes are about using assertions in Java, C++, [TBD Scala
and Python].
</p>
</div>
</div>

<div id="outline-container-orgd4de046" class="outline-2">
<h2 id="orgd4de046"><span class="section-number-2">2</span> <del>Program</del> Process State</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Assertions are expressions yielding true/false on a process state.</li>
<li>We should really say <b>process</b> state.</li>

<li>So, what is a state?</li>
</ol>
</div>

<div id="outline-container-org30c8169" class="outline-3">
<h3 id="org30c8169"><span class="section-number-3">2.1</span> Process State: Crudely</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Crudely, a full dump, including the portions of the state
maintained by the OS for the process.</li>
</ol>
</div>
</div>

<div id="outline-container-org1de41f0" class="outline-3">
<h3 id="org1de41f0"><span class="section-number-3">2.2</span> Process State: Refined</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>A labeled collection of all variables and their values at a given
moment
<ol class="org-ol">
<li>Include all scopes (global, local, &#x2026;)</li>
<li>Includes "external" objects: files, network connections, &#x2026;</li>
</ol></li>
<li>Observers do not alter the process state</li>
<li>Non-Observers (for lack of a consensus term)
<ol class="org-ol">
<li>Before beginning: process state S' (S prime)</li>
<li>After the operation: process state S (S no prime)</li>
<li>Occasionally, S == S'  (deep equality)</li>
<li>Almost always, S != S'</li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga6e8fab" class="outline-2">
<h2 id="orga6e8fab"><span class="section-number-2">3</span> What are Assertions?</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>An assertion is an expression on a program state that we expect to
evaluate to true.  Without side effects.</li>

<li>Assertions are predicates written using the syntax of the host
programming language.  All the variables are those of a program.
We are allowed to write side-effect free Boolean functions to deal
with for-all and there-exists quantifiers.</li>

<li>Simple assertions are made up of Boolean expressions.</li>
<li>Deeper assertions use First or Higher Order Logics.</li>

<li>An assertion is placed at a control point.</li>
</ol>
</div>
</div>


<div id="outline-container-org004d051" class="outline-2">
<h2 id="org004d051"><span class="section-number-2">4</span> Floyd-Hoare Triplets</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><i>{P} S {Q}</i> is known as the Floyd-Hoare Triplet, named after Turing
Award winners Robert Floyd and Tony Hoare.</li>

<li>P and Q are assertions.  S is a block of code.</li>
</ol>
</div>

<div id="outline-container-orged8c0b3" class="outline-3">
<h3 id="orged8c0b3"><span class="section-number-3">4.1</span> Semantics of {P} S {Q}</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>This triplet stands for the following: Let t' be a state satisfying
P.  Execute S on t'.  Suppose S terminates; let us call the
resulting state t.  Then, t satisfies Q.</li>

<li>The {P} S {Q} yields a true/false value.  There is no middle ground
of "may be" or "undefined".  We are assuming that there is no
middle ground for each of P, Q and S.</li>

<li>So what if S does not terminate? Cryptic, but then {P} S {Q} is not
saying any thing about whether Q holds.  We could not reach the
control point where Q is stated.</li>

<li>What if no state satisfies P?  Again, {P} S {Q} is not saying any
thing about the behavior of S.  It may "work" or not.  But, the
Boolean value of the box [{P} S {Q}] is true just as [False =&gt; Any]
is true.</li>

<li>Note that the triplet is about <i>partial</i> correctness: It omits
termination.</li>

<li>In the context of C++/Java, the notation changes a little:
<code>/*@ P */ S /*@ Q */</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgbc5e5be" class="outline-3">
<h3 id="orgbc5e5be"><span class="section-number-3">4.2</span> Pre-Conditions (aka Entry Assertions)</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Let S be a method.  Every method has (i) a precondition P, and (ii) a
post condition Q.</li>

<li>Pre-condition P is expected to be true just before the method is
entered.</li>

<li>A pre-condition can talk about the arguments, and globals, but not
about the local variables of the method.</li>
</ol>
</div>
</div>

<div id="outline-container-org620c9b4" class="outline-3">
<h3 id="org620c9b4"><span class="section-number-3">4.3</span> Post-Conditions (aka Exit Assertions)</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Post-condition Q is expected to be true just before the method is returning.</li>

<li>A post-condition can talk about the values of arguments at entry,
and the values of globals at entry and exit, but not about the
local variables of the method.  We will invent some notation to
describe the values at entry; e.g., old-x, or x.old.</li>

<li>If the method is a function a post-condition can talk about the
return value.</li>
</ol>
</div>
</div>

<div id="outline-container-orge7a9fd2" class="outline-3">
<h3 id="orge7a9fd2"><span class="section-number-3">4.4</span> Weakest and Strongest</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>Given two assertions A1 and A2, if A1 implies A2, we say that A1 is
stronger than A2.</li>

<li>For a given S, we prefer the weakest P.</li>

<li>For a given S, we prefer the strongest P.</li>
</ol>
</div>
</div>

<div id="outline-container-org22dc590" class="outline-3">
<h3 id="org22dc590"><span class="section-number-3">4.5</span> Design-by-Contract</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li>Imagine we are yet to develop S.  Consider it a method.</li>

<li>It is the responsibility of the caller to guarantee that a
pre-condition holds.  The method is expected to assume this without
checking.</li>

<li>It is the responsibility of the developer of S to guarantee that
the post condition holds upon return from S.</li>

<li><a href="../OODesign/design-by-contract.html">../OODesign/design-by-contract.html</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org7c11a5d" class="outline-2">
<h2 id="org7c11a5d"><span class="section-number-2">5</span> Loop Invariant</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Every loop has an assertion that describes the overall effect of
the loop.  We place it within the loop.  It is called a loop
invariant.</li>

<li>For while-loops, the traditional location for the loop invariant is
just-left-of the Boolean expression.  (Just-right of the while
reserved word.)</li>

<li>Invariant means that the relationship given remains true every time
control hits the location.  Not that nothing changes.  E.g., x &gt;
y + 2 can be an invariant, even though both x and y change.</li>

<li>We wish to write the strongest assertion as the loop invariant.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbcf5fdc" class="outline-2">
<h2 id="orgbcf5fdc"><span class="section-number-2">6</span> Class Invariant</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Every class has an assertion CI that describes the relationships
among its data members and public methods.  This called the class
invariant.</li>

<li>CI is part of the pre- and post-condition of every public method M.
<ol class="org-ol">
<li>The pre-condition of M will be (CI and R1)</li>
<li>The post-condition of M will be (CI and Q1)</li>
<li>The "and" shown above is typical.</li>
</ol></li>

<li>CI is not expected to hold before a constructor method.</li>
<li>CI is expected to hold after a constructor method.</li>

<li>We wish to write the strongest assertion as the class invariant.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc3d86ee" class="outline-2">
<h2 id="orgc3d86ee"><span class="section-number-2">7</span> Assertion Examples</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><p>
Ex: Assertions for sorting: 
</p>
<pre class="example">
{n &gt;= 0}  sorting-alg {sorted(a[0..n-1]) and perm(a, a')} 

</pre></li>

<li><a href="./assertions-in-the-small.html">Assertions, with Tiny Examples</a></li>
<li><a href="./practical-advice.html">Practical-Advice</a> on Writing Assertions</li>
<li>The <a href="./3np1.html">3n+1</a> Termination Problem</li>
<li><a href="./assertions-java.html">Assertions in Java</a></li>
<li><a href="./assertions-cpp.html">Assertions in C++</a></li>
</ol>
</div>
</div>

<div id="outline-container-org539cd96" class="outline-2">
<h2 id="org539cd96"><span class="section-number-2">8</span> The Meaning of Silence</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Consider {pre P:: x is an integer} S {post Q:: x is a
prime number}.  
<ol class="org-ol">
<li>Assume that this code S is part of a program that also uses an
integer variable named y.</li>
<li>The obligations of S are clear.  At the end of it, the value
that x has must be a prime number.</li>
</ol></li>
<li>But what about y?  If the value of y was y0 before S, can we expect
that y is equal to y0 after S?  The pre- and post- were silent on
y.  So is S free to do what ever to y?</li>
<li>Suppose S was x := exp.  Do not jump to the conclusion that after
all this is an assignment to x, therefore y could not change.</li>
<li>From now on, our expectation is this: If we have a sequence of
statements S, and its P and Q are silent with respect to (wrt) y,
then y must remain as it was before/after S.</li>
</ol>
</div>
</div>

<div id="outline-container-orge0104fe" class="outline-2">
<h2 id="orge0104fe"><span class="section-number-2">9</span> For All &#x2026;</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>There is an implicit <b>for all</b> in the assertions.  E.g., when we
write n &gt;= 0 in the entry assertions, it includes a <code>for all n</code>
that you may give so that n &gt;=0.  The n that is bound here is taken
in all subsequent assertions &#x2013; in loop invariants and in the exit
assertion.</li>
</ol>
</div>
</div>

<div id="outline-container-org0e15932" class="outline-2">
<h2 id="org0e15932"><span class="section-number-2">10</span> "When" and "for how long" must an assertion be true?</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>This question is important when we have threads/ processes.</li>
<li>Consider the S and Q as above.  Instantaneously after S finished, Q
is true.  Are we expecting that Q will remain true, say for another
60 secs?</li>
<li>Consider S; S2.  Let e1 be the ending time of S, let b2 be the
beginning time stamp of S2.  Recall that in all modern PLs, we must
not assume that b2 == e1 + delta.  Clearly, delta cannot be
negative.  We cannot say that for some d, delta &lt; d.</li>
<li>Concurrency literature talks about "interference".  Without
interference, we expect the post condition Q to hold good at least
until S2 starts.  In the presence of interference, we must not
expect this.</li>
</ol>
</div>
</div>


<div id="outline-container-orgff833b8" class="outline-2">
<h2 id="orgff833b8"><span class="section-number-2">11</span> References</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>Gries, David, The Science of Programming, Springer, 2012 [shouldn't
this be 1981?].  Highly Recommended.</li>

<li>Alagic, Suad, and Michael A. Arbib. The Design of Well-Structured
and Correct Programs. Springer Science &amp; Business Media, 2013.
Highly Recommended.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2015-09-03 2020-09-16
</div>
</body>
</html>
